In [1]:
import numpy as np
import pandas as pd
import researchpy as rp
from scipy import stats

In [2]:
bank=pd.read_csv(r"C:\ksr\data science\DS_batch1\datasets\bank_market.csv")

In [3]:
bank.head()

,Cust_num,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,1,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,2,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,3,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,4,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,5,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [4]:
df=bank[["marital","default"]]

In [6]:
df.head()

   marital default
0  married      no
1   single      no
2  married      no
3  married      no
4   single      no

In [7]:
df["marital"].value_counts()

married     27214
single      12790
divorced     5207
Name: marital, dtype: int64

In [8]:
df["default"].value_counts()

no     44396
yes      815
Name: default, dtype: int64

In [15]:
rp.summary_cat(df["default"])

  Variable Outcome  Count  Percent
0  default      no  44396     98.2
1              yes    815      1.8

In [17]:
rp.summary_cat(df[["marital","default"]])

  Variable   Outcome  Count  Percent
0  marital   married  27214    60.19
1             single  12790    28.29
2           divorced   5207    11.52
3  default        no  44396    98.20
4                yes    815     1.80

In [19]:
pd.crosstab(df["marital"],df["default"])

default      no  yes
marital
divorced   5079  128
married   26766  448
single    12551  239

In [20]:
crosstab=pd.crosstab(df["marital"],df["default"])
crosstab

default      no  yes
marital
divorced   5079  128
married   26766  448
single    12551  239

In [21]:
stats.chi2_contingency(crosstab)

(16.71938561183797,
 0.00023411624184748917,
 2,
 array([[ 5113.13556435,    93.86443565],
        [26723.42447634,   490.57552366],
        [12559.4399593 ,   230.5600407 ]]))

In [23]:
table,results=rp.crosstab(df["marital"],df["default"],test="chi-square")

In [24]:
table

         default
default       no  yes    All
marital
divorced    5079  128   5207
married    26766  448  27214
single     12551  239  12790
All        44396  815  45211

In [25]:
results

                Chi-square test  results
0  Pearson Chi-square ( 2.0) =   16.7194
1                    p-value =    0.0002
2                 Cramer's V =    0.0192